nxp-mcuxpresso/mcux-soc-svd/MCXN536T/MCXN536T_cm33_core1.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SMARTDMAARCHB_INMUX[%s]</name>
          <description>Inputmux Register for SMARTDMA Arch B Inputs</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number select to SmartDMA ARCHB input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>FlexIO interrupt is selected as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>GPIO P0_1 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>GPIO P0_2 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>GPIO P0_3 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>GPIO P0_4 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>GPIO P0_5 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>GPIO P0_6 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>GPIO P0_7 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>GPIO P0_8 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>GPIO P0_9 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>GPIO P0_10 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>GPIO P0_11 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>GPIO P0_12 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>GPIO P0_13 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>GPIO P0_14 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>GPIO P0_15 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>SCT0 SCT_OUT8 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>SCT0 SCT_OUT9 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>MRT0 MRT_CH0_IRQ input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>MRT0 MRT_CH1_IRQ input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>CTIMER4_MAT3 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>CTIMER4_MAT2 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>CTIMER3_MAT3 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>CTIMER3_MAT2 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>CTIMER1_MAT3 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>CTIMER1_MAT2 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>UTICK0 UTICK_IRQ input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>WWDT0 WDT0_IRQ input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>ADC0 ADC0_IRQ input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>CMP0_IRQ input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>LP_FLEXCOMM7_IRQ input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>LP_FLEXCOMM6_IRQ input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>LP_FLEXCOMM5_IRQ input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>LP_FLEXCOMM4_IRQ input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>LP_FLEXCOMM3_IRQ input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>LP_FLEXCOMM2_IRQ input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>LP_FLEXCOMM1_IRQ input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>LP_FLEXCOMM0_IRQ input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>DMA0_IRQ input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>DMA1_IRQ input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>SYS_IRQSYS_IRQ combines the CDOG IRQ, WWDT IRQ, MBC secure violation IRQ, Secure AHB Matrix secure violation IRQ, GDET IRQ, ELS S50 error IRQ, PKC error IRQ, and VBAT IRQ using the logical OR operation. input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>RTC_COMBO_IRQ input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>PINT0 GPIO_INT_BMATCH input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>usb0 start of frame input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>usb1 start of frame input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>OSTIMER0 OS_EVENT_TIMER_IRQ input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>ADC1_IRQ input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>CMP0_IRQ/CMP1_IRQ/CMP2_IRQ input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>DAC0_IRQ input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>DAC1_IRQ/DAC2_IRQ input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>PWM0_IRQ input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>PWM1_IRQ input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>QDC0_IRQ input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>QDC1_IRQ input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>EVTG_OUT0A input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>EVTG_OUT1A input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>GPIO1_alias0 GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>GPIO1_alias1 GPIO1 Pin Event Trig 1 input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>GPIO2_alias0 GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>GPIO2_alias1 GPIO2 Pin Event Trig 1 input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>GPIO3_alias0 GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>GPIO3_alias1 GPIO3 Pin Event Trig 1 input is selected</description>
                  <value>0x46</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
